# EllipseFocusMrkVisible Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..EllipseFocusMrkVisible Property
ParameterTypeId Class See Also
---
"Focus Marks Visible"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId EllipseFocusMrkVisible { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property EllipseFocusMrkVisible As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ EllipseFocusMrkVisible {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace